michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
/******************************************************************************
*  Filename:       sblAppEx.cpp
*  Revised:        $Date: 2014-10-09 14:34:40 +0200 (to, 09 okt 2014) $
*  Revision:       $Revision: 32696 $
*
*  Description:    Serial Bootloader Library application example.
*                  This example enumerates all COM devices and lets you
*                  select which port to connect to. The example assumes the
*                  connected device is a CC2538 or a CC2650 and programs a blinky
*                  onto the device. After programming the blinky, bootloader
*                  mode may be forced by holding the SELECT button on 06EB
*                  when resetting the chip.
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/
#ifndef _GNU_SOURCE
	#define _GNU_SOURCE
#endif
#include <stdlib.h>
#include <stdint.h>
#include <sbllib.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <syslog.h>


#include <string.h>
#include <stdio.h>
#include <unistd.h>
#include <syslog.h>
#include <stdlib.h>
#include <time.h>
#include <sys/timeb.h>  /* ftime, timeb (for timestamp in millisecond) */
#include <sys/time.h>   /* gettimeofday, timeval (for timestamp in microsecond) */
#include "CC2650_fw_update.h"

#ifdef ANDROID
	#define def_selected_serial_port "/dev/ttymxc2"
#else
	#ifdef OLINUXINO
			#define def_selected_serial_port "/dev/ttyS1"
	#else
			#define def_selected_serial_port "/dev/ttyUSB1"
	#endif
#endif

#ifdef OLINUXINO_LIB
extern "C"
#else
extern
#endif// Calculate crc32 checksum the way CC2538 and CC2650 does it.
uint32_t calcCrcLikeChip(const unsigned char *pData, unsigned long ulByteCount)
{
    uint32_t d, ind;
    uint32_t acc = 0xFFFFFFFF;
    const uint32_t ulCrcRand32Lut[] =
    {
        0x00000000, 0x1DB71064, 0x3B6E20C8, 0x26D930AC,
        0x76DC4190, 0x6B6B51F4, 0x4DB26158, 0x5005713C,
        0xEDB88320, 0xF00F9344, 0xD6D6A3E8, 0xCB61B38C,
        0x9B64C2B0, 0x86D3D2D4, 0xA00AE278, 0xBDBDF21C
    };

    while ( ulByteCount-- )
    {
        d = *pData++;
        ind = (acc & 0x0F) ^ (d & 0x0F);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
        ind = (acc & 0x0F) ^ (d >> 4);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
    }

    return (acc ^ 0xFFFFFFFF);
}
#ifdef TARGET_UBUNTU
extern "C" int is_OK_do_CC2650_reset(unsigned int enable_boot_mode)
{
	//enable_boot_mode;
	return 1;
}
#endif

#ifndef LOCALMAIN

#ifndef OLINUXINO_LIB
static void open_syslog(void)
{
	openlog("CC2650_fw_upd", LOG_PID|LOG_CONS, LOG_DAEMON);
	my_log(LOG_INFO, "Log just started");
}
#endif

#ifdef OLINUXINO_LIB
extern "C" int
#else
extern int
#endif
is_OK_do_CC2650_reset(unsigned int enable_boot_mode);


#if 0
static int64_t get_current_epoch_time_ms(void)
{
	struct timeb timer_msec;
	int64_t timestamp_msec; // timestamp in milliseconds
	if (!ftime(&timer_msec))
	{
		timestamp_msec = ((long long int) timer_msec.time) * 1000ll +	(long long int) timer_msec.millitm;
	}
	else
	{
		timestamp_msec = -1;
	}
	return timestamp_msec;
}
#endif


//
// Including functions for millisecond precision timing.
// Taken from http://stackoverflow.com/questions/2494356/how-to-use-gettimeofday-or-something-equivalent-with-visual-studio-c-2008
//
#include <time.h>

extern "C" void my_log(int print_level, const char *fmt, ...);

/// Application status function (used as SBL status callback)
static void appStatus(char *pcText, bool bError)
{
    if(bError)
    {
    	my_log(LOG_ERR, "%s", pcText);
    }
    else
    {
    	my_log(LOG_INFO, "%s", pcText);
    }
}

#ifdef OLINUXINO_LIB
static uint32_t percentage_progress = 0;
typedef struct _type_sbl_progress
{
	uint32_t phase_progress[enum_progress_sbl_numof];
	uint32_t overall_progress;
}type_sbl_progress;
type_sbl_progress the_sbl_progress;
void init_sbl_progress(void)
{
	memset(&the_sbl_progress, 0, sizeof(the_sbl_progress));
}
void update_sbl_progress(enum_progress_sbl e, uint32_t progress)
{
	if (e >= enum_progress_sbl_numof)
	{
		return;
	}
	if (progress > 100)
	{
		progress = 100;
	}
	if (the_sbl_progress.phase_progress[e] < progress)
	{
		the_sbl_progress.phase_progress[e] = progress;
	}
	the_sbl_progress.overall_progress = (100 * the_sbl_progress.phase_progress[enum_progress_sbl_write_flash] + 28 * the_sbl_progress.phase_progress[enum_progress_sbl_erase_flash]) / 128;
}
#endif

/// Application progress function (used as SBL progress callback)
static void appProgress(enum_progress_sbl e, uint32_t progress)
{
#ifdef OLINUXINO_LIB
	update_sbl_progress(e, progress);
	percentage_progress = the_sbl_progress.overall_progress;
#endif
}

#ifdef OLINUXINO_LIB
extern "C"
#endif
uint32_t get_CC2650_fw_update_progress(void)
{
#ifdef OLINUXINO_LIB
	return percentage_progress;
#else
	return 0;
#endif

