michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
}

// Defines
#define DEVICE_CC2538				0x2538
#define DEVICE_CC26XX				0x2650
#define CC2538_FLASH_BASE			0x00200000
#define CC26XX_FLASH_BASE			0x00000000
#ifndef OLINUXINO_LIB
static void my_at_exit(void)
{
	// at exit, close the system log
	closelog();
}
#endif


const char *tbl_msg_CC2650_fw_update_retcode[]=
{
	"OK",							// firmware updated OK
	"ERR_unable_to_reset_chip",				// unable to reset the CC2650 chip
	"ERR_unable_to_create_SBL_object", 		// unable to create serial boot-loader library object
	"ERR_unable_to_connect_with_the_chip",	// unable to connect with the chip
	"ERR_unable_to_open_the_firmware_file", 	//
	"ERR_unable_to_erase_the_flash",			// unable to erase the chips internal flash
	"ERR_writing_flash",						//
	"ERR_CRC_calculating_gone_bad",			//
	"ERR_CRC_checking_gone_bad",				//
	"ERR_chip_reset_gone_bad",				//
	"ERR_unable_to_seek_to_the_file_end",	//
	"ERR_unable_to_get_filesize",			//
	"ERR_unable_to_seek_where_the_file_begins", //
	"ERR_unable_to_allocate_the_read_buffer",
	"ERR_unable_to_read_the_whole_file",
	"ERR_unable_to_close_the_file",
	"ERR_filesize_too_small",
	"ERR_invalid_header_CRC32",
	"ERR_invalid_header_magic_key",
	"ERR_invalid_body_size",
	"ERR_invalid_body_CRC",
	"ERR_unable_to_reset_the_chip_in_normal_mode",
	"ERR_invalid_operation_requested",
};

#ifdef OLINUXINO_LIB
extern "C"
#endif
const char * get_msg_from_CC2650_fw_update_retcode(enum_do_CC2650_fw_update_retcode r)
{
	if (r >= sizeof(tbl_msg_CC2650_fw_update_retcode) / sizeof(tbl_msg_CC2650_fw_update_retcode[0]))
	{
		return "UNKNOWN";
	}
	return tbl_msg_CC2650_fw_update_retcode[r];
}

#ifdef OLINUXINO_LIB
extern "C"
#endif
enum_do_CC2650_fw_update_retcode do_CC2650_fw_operation(enum_CC2650_fw_operation op, const char *path_binary_file, type_ASACZ_CC2650_fw_update_header *p_dst_header)
{
	enum_do_CC2650_fw_update_retcode r = enum_do_CC2650_fw_update_retcode_OK;
#ifndef OLINUXINO_LIB
	open_syslog();
	atexit(my_at_exit);
#endif
	my_log(LOG_INFO, "%s + starts", __func__);
	init_sbl_progress();

#ifdef OLINUXINO_LIB
	percentage_progress = 0;
#endif

	uint32_t do_fw_update = 0;

	switch(op)
	{
		case enum_CC2650_fw_operation_update_firmware:
		{
			my_log(LOG_INFO, "%s firmware update requested", __func__);
			do_fw_update = 1;
			break;
		}
		case enum_CC2650_fw_operation_get_file_header_info:
		{
			my_log(LOG_INFO, "%s firmware file get header info requested", __func__);
			break;
		}
		default:
		{
			my_log(LOG_ERR, "%s invalid operation requested %u", __func__, op);
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_operation_requested;
			break;
		}
	}

	//
	// START: Program Configuration
	//
	/* Device type. (Binary-coded decimal of the device
	     e.g. 0x2538 for CC2538 and 0x2650 for CC2650) */
	uint32_t deviceType = 0x2650;

	//
	// END: Program configuration
	//

	SblDevice *pDevice = NULL;		// Pointer to SblDevice object
	const char * fileName;			// File name to program
	uint32_t byteCount = 0;			// File size in bytes
    uint32_t fileCrc, devCrc;		// Variables to save CRC checksum
	uint32_t devFlashBase;	    	// Flash start address
	char * pvWrite = NULL;				// Vector to application firmware in.
	FILE * file_input = NULL;		// File stream

	pvWrite = (char *)malloc(1);// Vector to application firmware in.

	fileName = path_binary_file;

	if (do_fw_update)
	{
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			if (!is_OK_do_CC2650_reset(1))
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_reset_chip;
				my_log(LOG_ERR, "ERR_unable_to_reset_chip");
			}
		}

		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{

			devFlashBase = CC26XX_FLASH_BASE;

			//
			// Set callback functions
			//
			SblDevice::setCallBackStatusFunction(&appStatus);
			SblDevice::setCallBackProgressFunction(&appProgress);

			//
			// Create SBL object
			//
			pDevice = SblDevice::Create(deviceType);
			if(pDevice == NULL)
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_create_SBL_object;
				my_log(LOG_ERR, "ERR_unable_to_create_SBL_object");
			}
		}
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			unsigned int connected_OK = 0;
#define def_max_try_connect_CC2650 40
			int idx_try;
			for (idx_try = 0; !connected_OK && idx_try < def_max_try_connect_CC2650; idx_try++)
			{
				if (idx_try)
				{
					my_log(LOG_INFO, "trying again closing and reopening the serial port, try %u of %u", idx_try +1, def_max_try_connect_CC2650);
				}
				else
				{
					my_log(LOG_INFO, "Sleeping before opening the serial port %s", def_selected_serial_port);
				}
				usleep(100*1000);
				//
				// Connect to device
				//
				my_log(LOG_INFO, "Opening the serial port %s", def_selected_serial_port);
				if(pDevice->connect(def_selected_serial_port, false) != SBL_SUCCESS)
				{
					pDevice->CloseSerialPort();
				}
				else
				{
					connected_OK = 1;
				}
			}
			if (connected_OK)
			{
				my_log(LOG_INFO, "device connected OK");
			}
			else
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_connect_with_the_chip;
				my_log(LOG_ERR, "Opening the serial port %s something went wrong", def_selected_serial_port);
			}
		}
	}

	// read file with all of the checks needed
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Read file
		//
		my_log(LOG_INFO, "Opening the file %s", fileName);
		file_input = fopen(fileName, "rb");
		if( !file_input)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_open_the_firmware_file;
			my_log(LOG_ERR, "unable to open the file %s", fileName);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Get file size:
		//
		if (fseek(file_input, 0L, SEEK_END) != 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_seek_to_the_file_end;
			my_log(LOG_ERR, "unable to seek to the very end of the file");
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		long int ft = ftell(file_input);
		byteCount = (uint32_t)ft;
		if (ft < 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_get_filesize;
			my_log(LOG_ERR, "unable to get the file size");
		}
		else
		{
			my_log(LOG_INFO, "Number of bytes in the file: %u", byteCount);
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fseek(file_input, 0L, SEEK_SET) != 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_seek_where_the_file_begins;
			my_log(LOG_ERR, "unable to seek to the begin of the file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Read data
		//
		pvWrite = (char*)realloc(pvWrite, byteCount);
		if (!pvWrite)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_allocate_the_read_buffer;
			my_log(LOG_ERR, "unable to allocate the read buffer");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fread((char*)&pvWrite[0], byteCount, 1, file_input) != 1)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_read_the_whole_file;
			my_log(LOG_ERR, "unable to read the whole file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fclose(file_input) != 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_close_the_file;
			my_log(LOG_ERR, "unable to close the file");
		}
		file_input = NULL;
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (byteCount <= sizeof(type_ASACZ_CC2650_fw_update_header))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_filesize_too_small;
			my_log(LOG_ERR, "the file size is too small to contain both header and body");
		}
	}

	type_ASACZ_CC2650_fw_update_header * p_header = (type_ASACZ_CC2650_fw_update_header *)&pvWrite[0];
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		uint32_t calc_crc_header = calcCrcLikeChip((unsigned char *)p_header, sizeof(type_ASACZ_CC2650_fw_update_header) - sizeof(p_header->header_CRC32_CC2650));
		if (calc_crc_header != p_header->header_CRC32_CC2650)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_header_CRC32;
			my_log(LOG_ERR, "header has invalid header CRC : calculated is 0x%08X, header has 0x%08X", calc_crc_header, p_header->header_CRC32_CC2650);
		}
		else
		{
			my_log(LOG_INFO, "magic key  %s"	, p_header->magic_name);
			my_log(LOG_INFO, "ASCII ver. %s"	, p_header->ascii_version_number);
			my_log(LOG_INFO, "date       %s"	, p_header->date);
			my_log(LOG_INFO, "fw version %u.%u.%u"	, p_header->fw_version_major, p_header->fw_version_middle, p_header->fw_version_minor);
			my_log(LOG_INFO, "body size  %u"		, p_header->firmware_body_size);
			my_log(LOG_INFO, "BODY CRC   0x%08X"	, p_header->firmware_body_CRC32_CC2650);
			my_log(LOG_INFO, "header CRC 0x%08X"	, p_header->header_CRC32_CC2650);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (strcmp((const char*)p_header->magic_name, (const char*)def_magic_name_ASACZ_CC2650_fw_update_header))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_header_magic_key;
			my_log(LOG_ERR, "header has invalid magic name %s", (const char*)p_header->magic_name);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (p_header->firmware_body_size + sizeof(type_ASACZ_CC2650_fw_update_header) != byteCount)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_body_size;
			my_log(LOG_ERR, "header has invalid body size; expected %u, read %u", p_header->firmware_body_size, (unsigned int)(byteCount - sizeof(type_ASACZ_CC2650_fw_update_header)));
		}
	}

	unsigned char * p_firmware_body = (unsigned char *)&pvWrite[0];
	uint32_t body_size = 0;
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		body_size = p_header->firmware_body_size;
		p_firmware_body = (unsigned char *)&pvWrite[0] + sizeof(type_ASACZ_CC2650_fw_update_header);
		//
		// Calculate file CRC checksum
		//
		my_log(LOG_ERR, "about to calculate the CRC");
		fileCrc = calcCrcLikeChip(p_firmware_body, body_size);
		my_log(LOG_ERR, "the CRC is 0x%X", fileCrc);
	}

